<a href="https://colab.research.google.com/github/aweeeaja/Machine-learning/blob/main/Missing_Value_%26_Label_Encode.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd
import numpy as np

In [ ]:
# koneksi ke google drive
from google.colab import drive
drive.mount('/content/drive')

membaca file

In [ ]:
cf = pd.read_csv("/content/drive/MyDrive/Machine Learning/File csv dan database/apartemen2.csv")
print (cf)

   KodeApt   Wilayah St_Milik Jum_Kamar
0    104.0    Bantul        Y         3
1    197.0    Sleman        N         3
2      NaN    Sleman        N       NaN
3    201.0     Yogya       12         1
4    203.0     Yogya        Y         3
5    207.0     Yogya        Y       NaN
6      NaN  KL-Progo      NaN         2
7    213.0    Bantul        Y        --
8    215.0    Bantul        Y        na

In [ ]:
#  cek ukuran dataset
cf.shape

(9, 4)

**cek adakah data null, jika ada berapa jumlah nya**

In [ ]:
# cek missing value
cf.isnull().values.any()

np.True_

In [ ]:
# banyaknya missing value
cf.isnull().sum().sum()

np.int64(5)

In [ ]:
# menghapus missing value
dataset_clean = cf.dropna()
print ('Ukuran dataset clean', dataset_clean)

Ukuran dataset clean    KodeApt Wilayah St_Milik Jum_Kamar
0    104.0  Bantul        Y         3
1    197.0  Sleman        N         3
3    201.0   Yogya       12         1
4    203.0   Yogya        Y         3
7    213.0  Bantul        Y        --
8    215.0  Bantul        Y        na

In [ ]:
# melihat kolom kodeapt
cf["KodeApt"].isnull()

0    False
1    False
2     True
3    False
4    False
5    False
6     True
7    False
8    False
Name: KodeApt, dtype: bool

In [ ]:
#melihat data pada kolom Jum_Kamar dan mencek data null pada kolom tersebut
cf["Jum_Kamar"]

0      3
1      3
2    NaN
3      1
4      3
5    NaN
6      2
7     --
8     na
Name: Jum_Kamar, dtype: object

In [ ]:
cf["Jum_Kamar"].isnull()

0    False
1    False
2     True
3    False
4    False
5     True
6    False
7    False
8    False
Name: Jum_Kamar, dtype: bool

In [ ]:
# membuat daftar missing value dan cek kembali data pada kolom Jum_Kamar no 7 dan 8 apa artinya
# membuat daftar missing values
missing_values =["n/a","na","--"]
cf = pd.read_csv("//content/drive/MyDrive/Machine Learning/File csv dan database/apartemen2.csv", na_values = missing_values)
cf["Jum_Kamar"]

0    3.0
1    3.0
2    NaN
3    1.0
4    3.0
5    NaN
6    2.0
7    NaN
8    NaN
Name: Jum_Kamar, dtype: float64

In [ ]:
cf["Jum_Kamar"].isnull()

0    False
1    False
2     True
3    False
4    False
5     True
6    False
7     True
8     True
Name: Jum_Kamar, dtype: bool

In [ ]:
# membuat daftar missing value dan cek data pada kolom St_Milik (no 3 apa artinya)
cf["St_Milik"]

0      Y
1      N
2      N
3     12
4      Y
5      Y
6    NaN
7      Y
8      Y
Name: St_Milik, dtype: object

In [ ]:
cf["St_Milik"].isnull()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
7    False
8    False
Name: St_Milik, dtype: bool

In [ ]:
# hitung kembali jumlah missing vallue pada setiap kolom
cf.isnull().sum()

KodeApt      2
Wilayah      0
St_Milik     1
Jum_Kamar    4
dtype: int64

In [ ]:
# banyaknya missing value
cf.isnull().sum().sum()

np.int64(7)

In [ ]:
# mengisi missing value dengan angka pada lokasi yang spesifik
cf["KodeApt"].fillna(837,inplace=True)
print(cf.KodeApt)
#mengisi pada lokasi spesifik
cf.loc[2,'KodeApt'] = 8837
print(cf.KodeApt)

0    104.0
1    197.0
2    837.0
3    201.0
4    203.0
5    207.0
6    837.0
7    213.0
8    215.0
Name: KodeApt, dtype: float64
0     104.0
1     197.0
2    8837.0
3     201.0
4     203.0
5     207.0
6     837.0
7     213.0
8     215.0
Name: KodeApt, dtype: float64

/tmp/ipython-input-3514147189.py:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  cf["KodeApt"].fillna(837,inplace=True)

In [ ]:
# mengganti nilai missing value
# mengganti missing value dengan median
median = cf["Jum_Kamar"].median()
cf["Jum_Kamar"].fillna(median,inplace=True)
print (cf.Jum_Kamar)

0    3.0
1    3.0
2    3.0
3    1.0
4    3.0
5    3.0
6    2.0
7    3.0
8    3.0
Name: Jum_Kamar, dtype: float64

/tmp/ipython-input-3199017625.py:4: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  cf["Jum_Kamar"].fillna(median,inplace=True)

In [ ]:
# melihat keseluruhan data
print (cf)

   KodeApt   Wilayah St_Milik  Jum_Kamar
0    104.0    Bantul        Y        3.0
1    197.0    Sleman        N        3.0
2   8837.0    Sleman        N        3.0
3    201.0     Yogya       12        1.0
4    203.0     Yogya        Y        3.0
5    207.0     Yogya        Y        3.0
6    837.0  KL-Progo      NaN        2.0
7    213.0    Bantul        Y        3.0
8    215.0    Bantul        Y        3.0

In [ ]:
# mengganti data non numeric pada lokasi yang spesifik
# mengganti pada lokasi spesifik pada kolom St_Milik
cf.loc[3, 'St_Milik'] = "N"
cf.loc[6, 'St_Milik'] = "Y"
print (cf)

   KodeApt   Wilayah St_Milik  Jum_Kamar
0    104.0    Bantul        Y        3.0
1    197.0    Sleman        N        3.0
2   8837.0    Sleman        N        3.0
3    201.0     Yogya        N        1.0
4    203.0     Yogya        Y        3.0
5    207.0     Yogya        Y        3.0
6    837.0  KL-Progo        Y        2.0
7    213.0    Bantul        Y        3.0
8    215.0    Bantul        Y        3.0

In [ ]:
#menyimpan file
cf.to_csv("/content/apartemen_ok.csv")

In [ ]:
# mengubah data non numeric menjadi numeric
# library
from sklearn.preprocessing import LabelEncoder
from pandas import DataFrame
# coba mengosongkan cf dengan cara import ulang pandas
import pandas as pd
import numpy as np

# baca file dataset
cf = pd.read_csv("/content/apartemen_ok.csv")

# buat objek LabelEncoder sekali saja
le = LabelEncoder()

# loop tiap kolom
for col in cf.columns:
    if cf[col].dtypes == 'object':
        cf[col] = le.fit_transform(cf[col].astype(str))

print(cf.head(10))

   Unnamed: 0  KodeApt  Wilayah  St_Milik  Jum_Kamar
0           0      104        0         1          3
1           1      197        2         0          3
2           2     8837        2         0          3
3           3      201        3         0          1
4           4      203        3         1          3
5           5      207        3         1          3
6           6      837        1         1          2
7           7      213        0         1          3
8           8      215        0         1          3

In [ ]:
cf.to_csv("/content/apartemen_numeric.csv", header = True, index = False)